'use strict'; //говорим, что работаем только в новом формате (строгий режим)

// let x = 5; alert( x++ ); // Постфиксная запись, всегда возвращает первоначальное значение и только потом изменяет

// [] + false - null + true // NaN

// let y = 1; let x = y = 2; alert(x); // Последовательное присваивание, код читаем справа на лево

// console.log([] + 1 + 2); // Будет 12, пустой массив превращает в строку

// console.log(typeof('1'[0])); //По индексу обращаемся к строке, 0 - это первый символ

// console.log( 2 && 1 && null && 0 && undefined ); // null

// console.log(!!(1 && 2) === (1 && 2)); // Два !! возвращают булиновое значение



